/**
 ****************************************************************************************************
 * @file        uc-os2_demo.h
 * @author      正点原子团队(ALIENTEK)
 * @version     V1.0
 * @date        2023-02-14
 * @brief       UCOSII实验3-消息队列、信号量集和软件定时器 实验
 * @license     Copyright (c) 2020-2032, 广州市星翼电子科技有限公司
 ****************************************************************************************************
 * @attention
 *
 * 实验平台：正点原子 Mini Pro H750开发板
 * 在线视频:www.yuanzige.com
 * 技术论坛:www.openedv.com
 * 公司网址:www.alientek.com
 * 购买地址:openedv.taobao.com
 *
 ****************************************************************************************************
 */

#ifndef __UC_OS2_DEMO_H
#define __UC_OS2_DEMO_H

void uc_os2_demo(void);

#endif
