#ifndef __WEBCAMERA_H
#define __WEBCAMERA_H 
#include "netplay.h" 
//////////////////////////////////////////////////////////////////////////////////	 
//本程序只供学习使用，未经作者许可，不得用于其它任何用途
//ALIENTEK STM32开发板
//APP-网络测试 代码	   
//正点原子@ALIENTEK
//技术论坛:www.openedv.com
//创建日期:2014/7/20
//版本：V1.0
//版权所有，盗版必究。
//Copyright(C) 广州市星翼电子科技有限公司 2009-2019
//All rights reserved									  
//*******************************************************************************
//修改信息
//无
////////////////////////////////////////////////////////////////////////////////// 	   
	
#define WEBCAM_FIFO_NUM			100			//定义FIFO数量
#define WEBCAM_LINE_SIZE		4096		//定义行大小(*4字节)

 
u8 webcam_play(void);
#endif















 



















